Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོའི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་དྲན་པར་གྱིས་ཤིག །
en: Great Cloud Essence, you should bring to mind this inconceivable Great Cloud discourse.

source: བདུད་རྩིའི་ཚིག་སྤྲིན་ཆེན་པོའི་མདོའི་ཡི་གེ་འབྲུ་ལྔའམ།
en: What are the five expressions of the nectar-like words of The Great Cloud discourse?

source: དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་ཟབ་པ་དང་། མཉམ་པ་ཉིད་དང་། རྟག་པ་དང་། ཐེར་ཟུག་པ་དང་། བརྟན་པ་འཆང་བའི་མདོའི་མིང་གི་དོན་ཡང་རུང་སྟེ
en: They are the profundity, equality, permanence, constancy, and stability of the greatness of the Tathāgata’s qualities. It is good to bear in mind the meaning of these words of the discourse.

source: གང་ན་ཡང་དག་པར་གནས་པ་དེར་ནི་མེའི་ལམ་གྱི་བཞི་མདོའི་དབུས་སུ་ཡང་འགྲོ་བར་བྱའོ། །
en: Wherever one abides correctly in this, one could even enter into the midst of a fiery intersection.#13

source: སྤྲིན་ཆེན་སྙིང་པོ་གཞན་ཡང་མཉན་པའི་དོན་དང་། བཀུར་སྟི་བྱ་བ་དང་། རི་མོར་བྱ་བ་དང་། མཆོད་པ་དང་། རིམ་གྲོ་བྱ་བའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་མེས་ཤིན་ཏུ་གང་བའི་ནང་དུ་ཡང་ཞུགས་ཏེ་འགྲོ་བར་བྱའོ། །
en: Great Cloud Essence, if as many world systems as there are grains of sand in the Ganges River were completely filled with fire, because of having listened to the meaning of The Great Cloud discourse and venerated it, copied it, made offerings to it, and paid homage to it, one could even enter into and abide within that fire.

source: སྤྲིན་ཆེན་སྙིང་པོ་གཞན་ཡིད་ལ་མ་སེམས་ཤིག་དང་།
en: “Great Cloud Essence, do not think of anything else.

source: ཁྱོད་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་རྗེས་སུ་ཡི་རང་སྟེ། བདེ་བ་དང་ལྡན་ནམ། རྙེད་པ་རབ་ཏུ་རྙེད་དོ་ཞེས་ཀྱང་བཀའ་སྩལ་པར་འགྱུར་རོ། །
en: The tathāgatas rejoice in you and will affirm that ‘the possession or acquisition of bliss will be fully attained.’

source: ཁྱོད་ཀྱིས་ཚིག་དང་ཡི་གེ་གཅིག་གི་ཐིག་ལེ་ལྟ་བུ་དག་ཀྱང་སྔོན་མ་ཐོས་པའི་དེ་བཞིན་གཤེགས་པའི་ཡུལ་ཟབ་ཅིང་ཕྲ་ལ་དོན་བཟང་པོ་དང་། ཚིག་འབྲུ་བཟང་པོར་སྦྱར་བའི་ཚིག་དང་ལྡན་པ་དག་རིང་པོ་མི་ཐོགས་པར་ཐོབ་པར་འགྱུར་རོ། །
en: It will not be long before you attain possession of those words of excellent meaning and composition that are connected with the subtle and fine domain of the Tathāgata and whose words and syllables, which are of a single pure essence, you have not heard before.

source: ཕྲ་བའི་ཚིག་དེ་དག་རྟོགས་པར་འདོད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་རྟག་པ་དང་། ཐེར་ཟུག་པ་དང་། བརྟན་པའི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་ཀྱི་སྤྱོད་པ་དང་། དེ་ཁོ་ནའི་སྤྱོད་པ་རྟོགས་པར་འདོད་པས་ནི་སྤྲིན་ཆེན་པོའི་མདོའི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པའི་སྤྱོད་པ་ལ་བརྩོན་པར་བྱའོ། །
en: By aspiring to comprehend those subtle words and aspiring to comprehend the conduct of the greatness of the Tathāgata’s qualities of permanence, constancy, and stability, as well as the conduct of reality, you should strive to engage in the conduct of the inconceivable domain of this Great Cloud discourse.

source: དམ་པའི་ཆོས་བརྟན་པར་བྱ་བ་དང་། མཉན་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་རྟག་པ་དང་། ཐེར་ཟུག་པ་དང་། བརྟན་པའི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་ཀྱང་གཞན་དག་ལ་རྒྱས་པར་བསྟན་པར་བརྩོན་པར་བྱའོ། །
en: In order to get them to listen to and attain stability in the sacred Dharma, you should broadly proclaim to others the greatness of the Tathāgata’s qualities of permanence, constancy, and stability.

source: དེ་བཞིན་གཤེགས་པ་རྟག་པ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་གཏན་དུ་མྱ་ངན་ལས་འདའ་བ་མེད་དོ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ཡང་ནུབ་པར་མི་འགྱུར་རོ་ཞེས་བྱ་བ་ལ་བརྩོན་པར་བྱ་སྟེགཞན་དག་ལ་ཡང་རྒྱས་པར་བཤད་པ་ལ་ཡང་བརྩོན་པར་བྱའོ། །
en: You should be diligent in understanding and extensively explaining to others that ‘the Tathāgata is permanent and never passes into parinirvāṇa’ and that ‘the Tathāgata’s teachings will never disappear or change.’ ”

source: དེ་ནས་དེའི་ཚེ་རྣམ་པར་འཐོར་རླུང་གི་རྒྱལ་པོ་རྣམས་ལྷའི་བདེ་བའི་ལོངས་སྤྱོད་དང་། ཡོངས་སུ་སྤྱོད་པའི་བདེ་བ་དང་། བསིལ་བའི་ཆུ་དང་འདྲེས་པའི་རླུང་དུས་ཚིགས་དྲུག་གི་མེ་ཏོག་དང་། འབྲས་བུས་རྒྱས་པ་དག་རབ་ཏུ་གཏོང་ཞིང་བཅོམ་ལྡན་འདས་ལ་སྲི་ཞུ་བྱ་བ་ལ་ཞུགས་སོ། །
en: At that time, Scattering Wind and all the great wind kings proceeded to send forth a blissful and enjoyable wind mixed with cool water and adorned with the flowers and fruits of all six seasons and various enjoyments of divine bliss, thereby paying reverence to the Bhagavān.

source: དེ་ནས་དེའི་ཚེ་སངས་རྒྱས་ཀྱི་མཐུས་ནམ་མཁའ་ལ་སྤྲིན་གྱི་ཚོགས་ཆེན་པོ་སྟང་ཟིལ་གྱི་ཁ་དོག་འདྲ་ཞིང་ཆུ་རོ་མངར་བ་རྣམ་པ་བཞིས་རྒྱས་པ་དག་འབྲུག་སྒྲ་སྒྲོགས་ཏེ། །
en: On that occasion, through the Buddha’s power, a great mass of clouds arose in the sky, black like obsidian and filled with water possessing the four aspects of sweetness.

source: ཆེམ་ཆེམ་རབ་ཏུ་ཆེམ་ཆེམ། ཀུན་ཏུ་རབ་ཏུ་ཆེམ་ཆེམ། མངོན་པར་རབ་ཏུ་ཆེམ་ཆེམ་མོ། །
en: With a thunderous roar, they rumbled, utterly rumbled, completely rumbled, and exceedingly rumbled.

source: ཆེམ་ནལ་རབ་ཏུ་ཆེམ་ནལ། ཀུན་ཏུ་རབ་ཏུ་ཆེམ་ནལ། མངོན་པར་རབ་ཏུ་ཆེམ་ནལ་ལོ། །
en: They crashed, utterly crashed, completely crashed, and exceedingly crashed.

source: བདུད་རྩིའི་འབྲུག་སྒྲ་སྒྲོགས་རབ་ཏུ་སྒྲོགས། ཀུན་ཏུ་རབ་ཏུ་སྒྲོགས་མངོན་པར་རབ་ཏུ་སྒྲོགས་སོ། །
en: Their nectar-like thunder roared, utterly roared, completely roared, and exceedingly roared.

source: སིལ་སྙན་དང་། གླུ་དབྱངས་ལྟ་བུའི་སྒྲ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡིད་དུ་འོང་བ་འབྱིན་རབ་ཏུ་འབྱིན། ཀུན་ཏུ་རབ་ཏུ་འབྱིན་མངོན་པར་རབ་ཏུ་འབྱིན་ཏོ། །
en: With sounds like cymbals and singing, all sentient beings were delighted, utterly delighted, completely delighted, and exceedingly delighted.

source: དིར་དིར་རབ་ཏུ་དིར་དིར། ཀུན་ཏུ་རབ་ཏུ་དིར་དིར། མངོན་པར་རབ་ཏུ་དིར་དིར་རོ། །
en: The clouds hummed, utterly hummed, completely hummed, and exceedingly hummed.

source: འཕྲོ་རབ་ཏུ་འཕྲོ། ཀུན་ཏུ་རབ་ཏུ་འཕྲོ། མངོན་པར་རབ་ཏུ་འཕྲོའོ། །
en: They radiated, utterly radiated, completely radiated, and exceedingly radiated.

source: འཁྲུགས་རབ་ཏུ་འཁྲུགས། ཀུན་ཏུ་རབ་ཏུ་འཁྲུགས། མངོན་པར་རབ་ཏུ་འཁྲུགས་སོ། །
en: They trembled, utterly trembled, completely trembled, and exceedingly trembled.

source: གློངས་རབ་ཏུ་གློངས། ཀུན་ཏུ་རབ་ཏུ་གློངས། མངོན་པར་རབ་ཏུ་གློངས་སོ། །
en: They churned, utterly churned, completely churned, and exceedingly churned.

source: གཡོས་རབ་ཏུ་གཡོས། ཀུན་ཏུ་རབ་ཏུ་གཡོས། མངོན་པར་རབ་ཏུ་གཡོས་སོ། །
en: They shook, utterly shook, completely shook, and exceedingly shook.

source: གློག་མང་པོ་འགྱུ་རབ་ཏུ་འགྱུ། ཀུན་ཏུ་རབ་ཏུ་འགྱུ། །མངོན་པར་རབ་ཏུ་འགྱུ་སྟེ།
en: Lightning flashed, utterly flashed, completely flashed, and exceedingly flashed.

source: བདག་ནི་སྲས་ལགས་སོ། །བདག་ནི་སྲས་ལགས་སོ། །ཞེས་སྒྲ་སྙན་པ་དག་གྲགས་པར་གྱུར་ཏོ། །
en: The melodious words “Excellent, my children; excellent, my children!” resounded.

source: དེ་ནས་དེའི་མོད་ལ་སངས་རྒྱས་ཀྱི་མཐུས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཕྲག་བཅུའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པ་དྲུག་ཏུ་འགུལ་རབ་ཏུ་འགུལ་ཀུན་ཏུ་རབ་ཏུ་འགུལ། མངོན་པར་རབ་ཏུ་འགུལ་ཏོ། །
en: At that time, through the Buddha’s power, the hundreds of millions of buddhafields within the ten directions and all the world systems, as numerous as atomic particles, quaked in six ways, utterly quaked, completely quaked, and exceedingly quaked.

source: ལྡེག་རབ་ཏུ་ལྡེག །ཀུན་ཏུ་རབ་ཏུ་ལྡེག །མངོན་པར་རབ་ཏུ་ལྡེག་གོ། །
en: They lurched, utterly lurched, completely lurched, and exceedingly lurched.

source: འཇིག་རྟེན་གྱི་ཁམས་འང་འགུལ་བར་མཐོང་ནས། ཡང་མྱུར་བ་མྱུར་བར་ཕན་ཚུན་འདྲེས་ཤིང་
en: Those who saw these world systems quake proceeded to run helter-skelter, mixing together.

source: ཕན་ཚུན་དུ་སྒྲ་འབྱིན་རབ་ཏུ་འབྱིན། ཀུན་ཏུ་རབ་ཏུ་འབྱིན། མངོན་པར་རབ་ཏུ་འབྱིན་ཏོ། །
en: Crying out to one another, they cried out, utterly cried out, completely cried out, and exceedingly cried out.

source: འགུལ་རབ་ཏུ་འགུལ། ཀུན་ཏུ་རབ་ཏུ་འགུལ། མངོན་པར་རབ་ཏུ་འགུལ་ལོ། །
en: They were shaken, utterly shaken, completely shaken, and exceedingly shaken.

source: ནམ་མཁའ་ཁེབས་པར་བྱེད་ཅིང་བཅུད་ཐམས་ཅད་དང་། རིན་པོ་ཆེ་དང་། སྨན་ཐམས་ཅད་དང་འདྲེས་པའི་ཆར་གྱི་རྒྱུན་ཤིན་ཏུ་ཆེན་པོ་འབེབས་སོ། །
en: The sky clouded over, and a mixture of all elixirs, jewels, and medicines showered down in a great torrent of rain.

source: སྤྲིན་གྱི་ཚོགས་ཆེའོ་ཅོག་འབྲུག་སྒྲ་སྒྲོགས་ཤིང་། འུར་འུར་ཆེམ་ཆེམ། དིར་དིར་ཏོག་ཡར། ཏུག་ཆོམ། ཁད་ཁད།
en: The entire great mass of clouds roared with thunder, clamored, rumbled, and hummed.

source: ལྷག་ལྷག་ཅིང་སེང་གེའི་སྒྲ་ཆེན་པོ་དང་། ཀླུའི་སྒྲ་ཆེན་པོ་ཡིད་དུ་འོང་བའི་སྒྲ་མངོན་པར་སྒྲོགས་སོ། །
en: From its highest summit came a slow, loud reverberation, and the pleasing sounds of a great lion’s roar and the nāga’s great roar resounded.

source: རྫ་རྔའི་སྒྲ་ཆེན་པོ་ལྟ་བུར་ཆེམ་ཆེམ། དིར་དིར། ཏོག་ཡར། ཏུག་ཆོམ་སྟེ། གློག་ཆེན་པོ་འབར་རབ་ཏུ་འབར་ནས་ལྗིབ་ལྗིབ་ཅིང་འདུག་གོ། །
en: There was a rumbling, humming reverberation, like the great sound of a drum, and the flash of many great bolts of lightning.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཁོ་ར་ཁོར་ཡུག་ཏུ་རིན་པོ་ཆེ་ཐམས་ཅད་དང་། རོ་དང་ལྡན་པའི་ཆུའི་ཆར་པ་བབ་སྟེ། མངོན་པར་བབ་པར་གྱུར་ཏོ། །
en: A great rainfall of all sorts of jewels and sweet water fell upon the entire great trichiliocosm world-system.

source: དེའི་ཚེ་འཛམ་བུའི་གླིང་གི་ཆུ་ཀླུང་ཆེན་པོ་བརྒྱད་དང་། ཆུ་བྲན་གྱི་ཚོགས་དུ་མ་དག་དང་། ཕུ་ཆུ་རྣམས་མངོན་པར་སྒྲ་སྒྲོགས་ཤིང་སྐད་འབྱིན་པར་གྱུར་ཏེཏུག་རིང་། ཤ་ཤོ། འུར་འུར། དིར་དིར། ཤྭ་ཤྭ་ཤིང་འདུག་སྟེ།
en: At that time, the eight great rivers of Jambudvīpa and all the myriads of lesser rivers and mountain streams began to babble resoundingly, clamoring, humming, and rushing.

source: མུ་དང་ཁ་ད་ཆད་དུ་གང་བར་གྱུར་ལ་རིན་པོ་ཆེ་ཐམས་ཅད་དང་། རོ་ཐམས་ཅད་དང་ལྡན་པའི་ཆུ་མངོན་པར་བབ་པར་གྱུར་ཏོ། །
en: They were filled to the limit with a vast downpour of all sorts of jewels and sweet water.

source: དེ་བཞིན་དུ་མཚོ་བྲན་དང་། རྫིང་དང་། རྫིང་ཆེན་པོ་རྣམས་ཀྱང་མུ་དང་། ཁ་ད་ཆད་དུ་གང་ལ། བཅུད་ཐམས་ཅད་དང་། རྩྭ་དང་། ནགས་ཚལ་གྱི་སྨན་ཐམས་ཅད་དང་འདྲེས་པའི་ཆུས་རྒྱས་པར་གྱུར་ཏེ
en: In the same fashion, all the lakes, pools, and ponds were filled to the limit by the vast downpour of a mixture of all elixirs and herbal medicines.

source: དེ་ལྟ་བུའི་བཀོད་པ་ཆེན་པོ་དག་དང་། སྤྲིན་གྱི་ཚོགས་ཆེན་པོ་གློག་གི་འོད་དང་འདྲེས་པའི་སྤྲིན་ཆེན་པོས་ཞག་བདུན་གྱི་བར་དུ་ཆར་ཤིན་ཏུ་ཕབ་བོ། །
en: For seven days, a rain of such great adornments fell from the great mass of clouds as lightning flashed.

source: འོན་ཀྱང་ཤ་སྦྲང་དང་། སྦྲང་བུ་དང་། སྡིག་སྦྲུལ་དང་། སྐམས་ན་གནས་པ་དང་། པི་ཚུ་ཀ་དང་། བྱའི་ཚོགས་ལ་སོགས་པ་དུད་འགྲོར་སྐྱེས་པ་ཐམས་ཅད་དང་། མི་རྣམས་དང་། སྲོག་ཆགས་ཐམས་ཅད་ལ་ཡང་གནོད་པར་མ་གྱུར་ཏོ། །
en: Yet despite this, no harm came to any flies, insects, crawlers, dry earth-dwelling creatures, birds, animals, humans, or any other living beings.

source: གྲང་བས་སྦྲེབས་པར་ཡང་མ་གྱུར་ཏོ། །
en: None were chilled by the cold, gritting their chattering teeth.

source: སོ་ཐམས་ཐམས་བྱེད་པར་ཡང་མ་གྱུར་ཏེ་དེ་དག་སྔོན་ཆད་ཡེ་མ་བྱུང་བའི་བདེ་བ་དང་དགའ་བ་ལ་རྩེ་བས་མངོན་པར་རྩེ་བར་གྱུར་ཏོ། །
en: All were joyful to an extent that they had never experienced before, and they played and frolicked in that joyous state.

source: སྔོན་ཆད་ཡེ་མ་བྱུང་བའི་བདེ་བ་ཐམས་ཅད་ཉམས་སུ་མྱོང་ངོ་། །སྔོན་ཆད་ཡེ་མ་བྱུང་བའི་རོ་ཞིམ་པོ་ཐམས་ཅད་མྱོང་ངོ་། །
en: They experienced bliss they had never before experienced, and they tasted a sweetness they had never before tasted.

source: སྦལ་པ་དང་། དུད་འགྲོར་སྐྱེས་པ་ཐམས་ཅད་ཀྱང་སྔོན་ཆད་ཡེ་མ་བྱུང་བའི་སྐད་མངོན་པར་འབྱིན་པར་གྱུར་ཏོ། །
en: All reptiles and animals let out a great cry as they had never done before.

source: དེའི་ཚེ་རྒྱལ་པོའི་ཁབ་དང་། བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་དང་བཅས་པ་དང་། ཚོང་རྡལ་དང་། ལུང་པའི་མདོ་དང་བཅས་པ་རྣམས་དང་། འཛམ་བུའི་གླིང་དང་བཅས་པར་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ས་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་སྐུད་པས་ཁེབས་ཏེལེགས་པར་བརྒྱན་པར་གྱུར་ཏོ། །
en: At that time, in Rājagṛha and Vulture Peak, and in all the different villages and districts in Jambudvīpa, the ground transformed into all sorts of jewels, and these places became covered and excellently adorned with a coating of various jewels.

source: རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་ཐམས་ཅད་དང་། རིན་པོ་ཆེའི་འཁྲི་ཤིང་ཐམས་ཅད་ཕན་ཚུན་འཁྲི་ཞིང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡིད་དུ་འཐད་པའི་སྒྲ་རབ་ཏུ་སྒྲོགས་ཏེ། ཕན་ཚུན་འཁྲོལ་བར་བྱེད་དོ། །
en: Jeweled trees and jeweled vines intertwined with each other, resounding and emitting sounds to please all sentient beings.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཨུད་པ་ལ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་རྣམས་ཀྱང་ཟླ་བ་དང་། ཉི་མའི་གཟི་བརྗིད་ཀྱི་འོད་རྣམས་ཀྱིས་ཕྱེ་བ་ལྟར་རྒྱས་པར་གྱུར་ཏོ། །
en: Blue lotus flowers, white lotus flowers, and great white lotus flowers, made from all sorts of jewels and brilliant as if illuminated by rays of moonlight and sunlight, spread broadly.

source: དཔེ་མེད་པའི་སྤོས་མང་པོས་བསྒོས་ཤིང་མེ་ཏོག་གིས་གང་སྟེ་མངོན་པར་ཁེབས་པར་གྱུར་པའི་ས་གཞི་ལ་མི་མ་ཡིན་པ་རྣམས་འཆག་པར་གྱུར་ཏོ། །
en: A great number of incomparable fragrances wafted forth, and nonhuman spirits walked upon the ground, covering it and filling it with flowers.

source: འཛམ་བུའི་གླིང་འདི་ན་གནས་པའི་འཁོར་ཆེན་པོ་དེ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཀྱང་མེ་ལོང་གི་ངོས་ལ་ཇི་ལྟ་བ་བཞིན་དུ་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་རྒྱས་པར་མཐོང་ངོ་། །
en: The entire great circle of beings residing in Jambudvīpa, together with all sentient beings, broadly beheld all world systems as though on the surface of a mirror.

source: དེ་ནས་དེའི་ཚེ་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སྐྱེས་པ་ཐམས་ཅད་ཀྱང་ཐེག་པ་ཆེན་པོ་འདོད་པའི་སེམས་དང་། ཐེག་པ་ཆེན་པོས་སྐོམ་པའི་སེམས་དང་། ཐེག་པ་ཆེན་པོ་ལ་དད་པའི་སེམས་དང་། གཅིག་ལ་གཅིག་མ་དང་། སྲིང་མོ་དང་། བུ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཤིན་ཏུ་སྦྱངས་ཤིང་རབ་ཏུ་བརྟན་པར་གྱུར་ནས་
en: At that time, all those beings born in animal states purified their minds and became fully immersed in the mental states of desire for the Great Vehicle, thirst for the Great Vehicle, and devotion to the Great Vehicle, regarding one another as mothers, sisters, and children.

source: མངོན་པར་གར་བྱེད་ཅིང་སྐད་འབྱིན་ཏེ་བཅོམ་ལྡན་འདས་ལ་སྲི་ཞུ་བྱེད་པ་ལ་ཞུགས་སོ། །
en: Then, with dance and song, they paid reverence to the Bhagavān.

source: དེ་ནས་དེའི་ཚེ་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པས་འཁོར་ཆེན་པོ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། སྲིན་པོ་དང་། གྲུལ་བུམ་དང་། འབྱུང་པོ་དང་། གཅོད་བྱེད་ཀྱི་བུ་དང་། བརྒྱ་བྱིན་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། ཚངས་པ་དང་། ནགས་ཚལ་གྱི་ལྷ་དང་། བྱ་དང་། རིག་སྔགས་འཆང་དང་། འདོད་དགུར་སྒྱུར་བའི་གཟུགས་ཅན་གྱི་ལྷ་མོའི་ཚོགས་འདྲེས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པས་འཛམ་བུའི་གླིང་ཤིན་ཏུ་རྒྱས་པར་གྱུར་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་སྤྲུལ་པ་ཐམས་ཅད་མཐོང་ནས་
en: At that time, through the magical manifestation of the Tathāgata, the great retinue of the hosts of devas, nāgas, yakṣas, garuḍas, kinnaras, mahoragas, gandharvas, asuras, rākṣasas, kumbhāṇḍas, bhūtas, pretas, Śakra, world guardians, Brahmā, forest gods, birds, knowledge-mantra holders, and the goddesses of all desirable forms observed, through the magical manifestation of the Tathāgata, the extensive land of Jambudvīpa and the emanation of all the world systems.

source: ཆེད་དུ་བསམས་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་ལྷའི་མེ་ཏོག་གི་སྤྲིན་གྱི་ཆར་མངོན་པར་ཕབ་བོ། །ལྷའི་སྤོས་ཀྱི་སྤྲིན་གྱི་ཆར་ཡང་མངོན་པར་ཕབ་བོ། །ལྷའི་ཕྱེ་མའི་སྤྲིན་གྱི་ཆར་ཡང་མངོན་པར་ཕབ་བོ། །ལྷའི་མེ་ཏོག་ཕྲེང་གི་སྤྲིན་གྱི་ཆར་ཡང་མངོན་པར་ཕབ་བོ། །ལྷའི་རིན་པོ་ཆེའི་སྤྲིན་གྱི་ཆར་ཡང་མངོན་པར་ཕབ་བོ། །ལྷའི་གདུགས་ཀྱི་སྤྲིན་གྱི་ཆར་ཡང་མངོན་པར་ཕབ་བོ། །
en: Having done so, with deliberate intention they showered down clouds of divine flowers, clouds of divine incenses, clouds of divine powders, clouds of divine flower garlands, clouds of divine jewels, and clouds of divine parasols upon the Tathāgata. They showered down clouds of divine garments, victory banners, and draped banners.

source: ལྷའི་གོས་དང་། རྒྱལ་མཚན་དང་། བ་དན་གྱི་སྤྲིན་གྱི་ཆར་ཡང་མངོན་པར་ཕབ་བོ། །
en: They showered down clouds of divine cymbals, large and small.

source: ལྷའི་སིལ་སྙན་དང་ཕེག་རྡོབ་པའི་སྤྲིན་གྱི་ཆར་ཡང་མངོན་པར་ཕབ་བོ། །ལྷའི་གླུ་དང་གར་དུ་ལྡན་པས་མངོན་པར་གར་བྱེད་པའི་སྤྲིན་གྱི་ཆར་ཡང་མངོན་པར་ཕབ་སྟེ
en: They showered down clouds of dancers who performed divine songs and dances.

source: དེ་བཞིན་གཤེགས་པའི་བསམ་གྱིས་མི་ཁྱབ་པའི་ཡུལ་གྱི་ཆོ་འཕྲུལ་ཆེན་པོ་ཡང་མངོན་སུམ་དུ་མཐོང་ལ། དེ་བཞིན་གཤེགས་པའི་ཚུལ་དམ་པའི་ཆོས་བརྟན་པ་དང་། ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོའི་རྒྱལ་པོ་དང་། དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་རྟག་པ་དང་། ཐེར་ཟུག་པ་དང་། བརྟན་པ་དང་། ཞི་བ་དང་། ཤཱཀྱའི་རིགས་ཀྱི་རྒྱུད་རྣམ་པར་དག་པ་དང་། དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་འབྲས་བུ་ཡོད་པའི་ཚིག་སྨོས་པ་ཐོས་ནས་
en: Directly seeing the great miracle of the inconceivable domain of the Tathāgata and having heard the fruitful words of the Tathāgata’s teachings on the steadfast sacred Dharma of the Tathāgata, the king of the Vaipulya discourses, the greatness of the Tathāgata’s qualities of permanence, eternality, constancy, and tranquility, and the purity of the Śākya family, they cavorted in utter joy.

source: མངོན་པར་རྩེ་ཞིང་རབ་ཏུ་དགའ་བའི་སེམས་བསྐྱེད་དེ་རང་རང་གི་བླ་གོས་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་གསོལ་ནས་ཁ་འཐུན་པར་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: Each of them draped their own robe upon the Tathāgata’s body, and with one voice they spoke these verses:

source: དེ་བཞིན་གཤེགས་པ་རྟག་པའི་སྐུ། །རྟག་པའི་མཚན་རྣམས་ཕུན་སུམ་ཚོགས། །ཡོན་ཏན་མཐའ་ཡས་མཚོ་མངའ་བ། །
en: “The permanent body of the Tathāgata Is perfectly replete with all the marks of permanence, Possessing an ocean of infinite virtuous qualities.

source: སངས་རྒྱས་ལ་ནི་མགོས་ཕྱག་འཚལ། །
en: I bow my head in homage to the Buddha!

source: བཅོམ་ལྡན་ཁྱོད་ནི་གཟི་བརྗིད་རྟག །
en: “Bhagavān, your brilliant presence is permanent.

source: རྟག་པའི་མཚན་ནི་མཛེས་པ་པོ། །
en: You are handsomely adorned with the marks of permanence.

source: དཔའ་བོ་ཆེན་པོ་ལྷ་ཡི་ལྷ། །བསམ་གྱིས་མི་ཁྱབ་དཔེ་མ་མཆིས། །
en: You are the great hero, the god of gods, Inconceivable and incomparable.

source: དཔའ་བོ་ཆེན་པོ་སྐུ་རྟག་པ། །ཏིང་འཛིན་ཡོན་ཏན་རྒྱ་མཚོ་ཆེ། །
en: “Great hero, your permanent body Is a great ocean of samādhi and virtuous qualities.

source: ཆོས་སྤྲིན་ཆར་པ་ཆེན་པོ་ཡི། །སྤྲིན་གྱི་མདོ་ནི་སྟོན་པ་པོ། །
en: You expound this discourse Of the cloud of Dharma that showers down a great rain.

source: ཞི་བའི་སྐུ་ལྡན་ཞི་གྱུར་པ། །ཞི་བའི་སྤྲིན་ནི་སྟོན་པ་པོ། །
en: “Possessing a tranquil body, you are tranquil, Expounding the cloud of tranquility.

source: གཟི་བརྗིད་ཞི་ཞིང་དཔལ་ཡང་ཞི། །
en: Your brilliant presence is tranquil, your glory is tranquil.

source: ཕུན་སུམ་ཚོགས་པ་ཞི་ལ་གནས། །
en: You dwell in a field of perfection.

source: གནས་རྟག་ཡེ་ཤེས་རྟག་པ་སྟེ། །
en: “Dwelling permanently, your gnosis is permanent.

source: ཞིང་རྟག་རྟག་པའི་རྣམ་པ་ལགས། །
en: Your permanent field appears permanently.

source: མི་རྟག་ཚོགས་ཀྱི་མུན་སེལ་བ། །
en: You dispel the darkness of those who proclaim your impermanence.

source: མི་རྟག་ཕྱོགས་ནི་ཟད་པར་མཛད། །
en: You put an end to notions of your impermanence.

source: ཁྱོད་ནི་ལྡེམ་ངག་མཁས་པ་སྟེ། །
en: “You are skilled in concealing the intention within your words.

source: སེམས་ཅན་ཀུན་ལ་ཐུགས་བརྩེ་ལྡན། །
en: You have compassion toward all sentient beings.

source: རྒྱལ་ཆེན་གསང་བ་མང་པོ་མངའ། །
en: Great king, you possess a multitude of secrets.

source: རྒྱལ་བ་ཟླ་བ་འོད་ཆེན་ལགས། །
en: Conqueror, you are as brilliant as the moon.

source: དེང་ནི་ལྷ་ཁྱོད་བཟང་བ་སྟེ། །མདོ་མཆོག་འདུ་སྟོན་སྟོན་པར་མཛད། །
en: “Today, excellent Lord, You expound the supreme discourse to the assembly.

source: དེང་ནི་ལྷ་ཁྱོད་མཛེས་གྱུར་ཏོ། །ལྷ་དང་འཇིག་རྟེན་འཐུན་པར་མཛད། །
en: Today, handsome Lord, You bring all divine and worldly beings into harmony.

source: འདྲེན་མཆོག་ལྷ་ཁྱོད་དེང་སྒྲོགས་ཏེ། །མདོ་བསྒྲགས་མིང་བཅས་སྟོན་པར་མཛད། །
en: “Supreme leader, Lord, today you make this proclamation, Expounding the words of this discourse.

source: རྒྱལ་པོའི་ཁབ་ནི་རི་དང་བཅས། །དེ་རིང་ཁྱོད་ཀྱིས་སྣང་བར་མཛད། །
en: You have today illuminated Rājagṛha with its Vulture Peak.

source: དེ་རིང་གདན་མཆོག་མཛེས་གྱུར་ཏེ། །ནོར་བུ་རིན་ཆེན་བྱེ་མང་སྤྲས། །
en: “Today your supreme throne is beautified, Decorated with billions of precious jewels.

source: ཡོན་ཏན་མཐའ་ཡས་བརྒྱན་པ་ཡི། །ས་གཞི་ལྷ་ཡི་གོས་ཀྱིས་བཀབ། །
en: Adorned by your infinite virtuous qualities, The ground is covered with divine brocade.

source: བབ་ལ་ལྡོང་རོས་མུགས་མཚལ་གྱིས། །ལེགས་བྲིས་འབྱེས་པར་བྱས་པ་ལ། །གསེར་དང་ནོར་བུ་བཻ་དཱུརྱ། །ཤེལ་རྣམས་ཀྱིས་ནི་ཡོངས་སུ་སྤྲས། །
en: “It is beautifully painted With pigments of orpiment, realgar, and cinnabar And completely decorated With gold, jewels, beryl, and crystals.

source: བྱ་རྒོད་ཕུང་པོ་མཆོག་གྱུར་པ། །
en: “Vulture Peak is supremely decorated.

source: གངས་ཀྱི་རི་ཡི་རྩེ་བརྒྱ་དག །རབ་ཏུ་འབར་བས་མཛེས་པར་བྱས། །
en: All the snowy mountain peaks Are adorned with utterly blazing brilliance.

source: དཔལ་དང་ལྡན་པའི་གྲོང་ཁྱེར་འདི། །ལྷ་ཡི་རིན་ཆེན་བླ་ཡི་ཚོགས། །
en: “This glorious city Is adorned with a host of divine jewels.

source: དགྲ་ཁང་དག་ཀྱང་ལེགས་པར་བཅས། །
en: Even opponents’ houses are beautifully decorated.

source: ཁང་བཟངས་གཞལ་མེད་ཁང་མང་གིས། །ཁོ་ར་ཡུག་ནས་མཛེས་པར་གྱུར། །
en: Its outskirts are beautified With many excellent mansions and immeasurable palaces.

source: མཚོ་བྲན་དང་བ་རྫིང་ཆེན་མཆོག །རྫིང་བུའི་ཆུས་ནི་ཡུལ་རྣམས་བརྒྱན། །བདེར་འཇུག་འབབ་སྟེགས་རྫིང་ཆེན་མང་། །
en: “All areas are adorned with the water Of clear lakes and great, supreme ponds, And there are many pools with landings by which to enter as one pleases.

source: རྒྱལ་པོའི་ཁབ་ནི་དེ་རིང་དུ། །ལྷ་ཡི་གྲོང་ཁྱེར་བཞིན་དུ་མཛེས། །
en: “Now, the city of Rājagṛha Is decorated like a divine city.

source: རྔ་དང་དུང་དང་དྲིལ་བུ་དང་། །པི་བང་རྒྱུད་བཅས་མ་སྦྲེངས་པར། །སྒྲ་ཆེན་སྒྲོགས་པར་འབྱུང་བ་འདི། །
en: Gongs, conch trumpets, bells, And vīṇās whose strings play without being plucked Resound with a great sound.

source: ངོ་མཚར་རྨད་དུ་བྱུང་བ་ལགས། །
en: This is truly a wondrous marvel!

source: ལུས་བདེ་ཡིད་དང་འཐད་པ་ཡི། །སེར་བུའི་ངད་ཀྱང་ལྡང་བར་གྱུར། །
en: “Fragrant breezes arise, Pleasing to the body and agreeable to the mind.

source: བར་སྣང་མཁའ་ལས་འབྲུག་སྒྲ་སྒྲོགས། །གློག་མང་ཐམས་ཅད་རྣམ་པར་འགྱུ། །རིན་ཆེན་གང་བའི་ཆུ་རྒྱུན་འབབ། །
en: The sounds of thunder resound in the air, And many bolts of lightning arise all around, As water, mixed with precious jewels, begins to flow.

source: དེ་དག་ཚུལ་གྱིས་ཆར་འབབ་ཅིང་། །སེམས་ཅན་མི་གནོད་འཐུན་པར་བསིལ། །
en: Rain showers down in like manner, Delightfully cooling sentient beings without causing any harm.

source: སྲོག་ཆགས་ཕྲ་མོ་སྡིག་སྦྲུལ་སྦྲང་། །དེ་རིང་རབ་དགའ་མགུ་ཞིང་རྩེ། །
en: Small critters, scorpions, snakes, and flies Frolic happily today.

source: ལེ་བརྒན་རྩི་དང་ས་ལ་དང་། །ཨ་ཏི་མུག་ཏ་ཏི་ལ་ཀཔུན་ན་ཀ་དང་ཀེ་ཏ་དང་། །ཀུ་རུ་བ་ཀ་ཀེ་ས་ར། །དྲི་ཞིམ་པ་དང་ནག་དང་། །ཨ་ག་རུ་དང་དོང་ཀ་ཡིས། །འོད་མའི་ཚལ་ནི་དེ་རིང་དུ། །ཤིན་ཏུ་སྣང་ཞིང་མཆིས་པར་བགྱིས། །
en: “Saffron, śāla, Atimukta, tilaka, Punnāga, ketaka, Kuravaka, kesara, Sugandha, nāga, Agaru, and karnikara— All these species of trees Have appeared today within the Bamboo Grove of Kalandaka.

source: བ་ཀུ་ལ་དང་ཙམ་པ་ཀ །ཐང་ཤིང་པྲི་ཡ་ཀུ་ཡི་ཤིང་། །གསེང་ཕྲོམ་དང་ནི་ཉོ་ཏི་དང་། །སྒྲོན་ཤིང་དང་ནི་ཡོངས་འདུ་དང་། །ཤིང་ལྗོན་ཚོགས་ཀྱིས་འོད་མའི་ཚལ། །དེ་རིང་སྣང་ཞིང་མཆིས་པར་བགྱིས། །
en: “Bakula, campaka, Fir, and priyaṇgu trees, Lodhra, pear, Pine, and pārijāta— All these species of trees Have appeared today within the Bamboo Grove of Kalandaka.

source: ཨ་མྲ་ཏ་ལ་ཀ་པིད་ཐ། །པ་ན་ས་དང་ཙན་དན་དམར། །བ་མངལ་ཤིང་ནི་དྲི་ཞིམ་གྱིས། །འོད་མའི་ཚལ་ནི་དེང་སྣང་བགྱིས། །
en: “The fragrances of the amṛtala, kapittha, Panasa, red sandalwood, And cows-womb trees Have appeared today within the Bamboo Grove of Kalandaka.

source: སྲ་རྩི་ཤིང་མཆོག་བ་རང་ག །ཨང་ཙུ་ཀ་དང་ཀེ་ས་རི། །མྱ་ངན་འཚང་དང་ཙམ་པ་ཀ །དམར་སེར་གྱིས་ནི་འོད་མའི་ཚལ། །དེ་རིང་འབར་ཞིང་མཆིས་པར་བགྱིས། །
en: “Excellent incense trees, paranga, Angcuka, kesari, Aśokam, campaka— Their reddish-yellow glow Has blazed today within the Bamboo Grove of Kalandaka.

source: རྒྱ་ཤུག་འཛམ་བུ་ཀམ་པ་རི། །སྐྱུ་རུ་བེལ་ལ་སེའུ་ཤིང་ནགས། །ཏེན་དུ་ཀ་དང་པ་ཀ་ས། །མངར་ཞིང་ཞིམ་པའི་ཤིང་ལྗོན་དང་། །འབྲ་ཀོའི་ཤིང་མང་རྒུན་ཤིང་ཚོགས། །བལ་བུ་དང་ནི་ས་བརྟོལ་མང་། །མ་ནི་ཀ་ར་དོང་ཀ་དང་། །ཤིང་ལྗོན་ཚོགས་ཀྱིས་འོད་མའི་ཚལ། །དེ་རིང་སྣང་ཞིང་མཆིས་པར་བགྱིས། །
en: “Juniper, rose apple, kambhārī, Gooseberry, mango, and cherry trees, Tenduka, bakasa, All sweet and fragrant trees; Great date palms, clusters of grapevines, Caragana, orchid trees, Manikara and karnikara— Groves of trees such as these Have appeared today within the Bamboo Grove of Kalandaka.
